GUdaoxi/FH_project/TSI/Library/Devices/fm33ht0xxa_tsi_driver.c
void TSI_Dev_SetupDirectClock(TSI_ClockConfTypeDef *clockConf)
{
    clockConf->snsClockSel = 0U;
}

void TSI_Dev_SetupPRSClock(TSI_ClockConfTypeDef *clockConf, uint8_t width, uint16_t coeff)
{
    clockConf->snsClockSel = 1U;
    clockConf->prsWidth = width;
    clockConf->prsCoeff = coeff;
}

void TSI_Dev_SetupSSCClock(TSI_ClockConfTypeDef *clockConf, uint8_t width, uint8_t point, uint16_t coeff)
{
    clockConf->snsClockSel = 2U;
    clockConf->sscWidth = width;
    clockConf->sscPoint = point;
    clockConf->sscCoeff = coeff;
}

uint32_t TSI_Dev_GetSCConvCycleNum(uint32_t resolution)
{
    return (uint32_t)((1UL << resolution) - 1UL);
}

uint32_t TSI_Dev_GetMCConvCycleNum(TSI_ClockConfTypeDef *clockConf, uint32_t resolution, uint32_t snsDiv)
{
    TSI_UNUSED(clockConf)
    TSI_UNUSED(snsDiv)
    return (uint32_t)((1UL << resolution) - 1UL);
}

void TSI_Dev_ClearWDT(void)
{
#if (TSI_SYS_IWDT_USED == 1U)
    /* Clear IWDT */
    IWDT->SERV = 0x12345A5AUL;
#endif
#if (TSI_SYS_WWDT_USED == 1U)
    /* Clear WWDT */
    if((WWDT->CNT & 0x3FFUL) > 512UL) {
        WWDT->CR = 0xACUL;
    }
#endif
}

/* Private function implemenations ------------------------------------------*/
static void TSI_ResetModule(TSI_Type *instance)
{
    if(instance == TSI) {
        RMU->PRSTEN = 0x13579BDFUL;             /* Reset */
        RMU->APBRSTCR1 |= (0x1UL << 5U);
        RMU->APBRSTCR1 &= ~(0x1UL << 5U);
        RMU->PRSTEN = 0x0UL;
        CMU->PCLKCR2 &= ~(0x1UL << 11U);        /* Disable bus clock */
        CMU->OPCER1 &= ~(0x1UL << 16U);         /* Disable operation clock */
    }
}

static bool TSI_ConfigSensor(TSI_WidgetTypeDef *widget, TSI_SensorTypeDef *sensor,
                             TSI_DevSnsConfTypeDef *confs, uint16_t idx)
{
    if(TSI_WIDGET_IS_SELF_CAP(widget)) {
        /* Self-cap widget */
        TSI_SelfCapWidgetTypeDef *scWidget = (TSI_SelfCapWidgetTypeDef *) widget;
        uint8_t freq;

        TSI_ASSERT(scWidget->swClkDiv > 0U && scWidget->swClkDiv <= 0xFFFU);
        TSI_ASSERT(scWidget->idacMod <= 0x7FU);
        TSI_ASSERT(scWidget->resolution >= 8U && scWidget->resolution <= 16U);
        TSI_ASSERT(scWidget->idacStep <= 6U);
#if (TSI_WIDGET_SC_TOUCHPAD_USED == 1U)
        if(widget->meta->type == TSI_WIDGET_SELF_CAP_TOUCHPAD &&
                sensor->meta->type == TSI_SENSOR_SELF_CAP_ROW) {
            TSI_ASSERT(((TSI_SelfCapTouchpadTypeDef *)scWidget)->idacModRow <= 0x7FU);
        }
#endif
#if (TSI_SC_USE_UNIFIED_IDAC_STEP == 0U)
        TSI_ASSERT(scWidget->idacCompStep <= 6U);
#endif

        for(freq = 0U; freq < TSI_TOTAL_SCAN_NUM; freq++) {
            uint32_t *pConf = &(confs[freq].conf[idx]);

            TSI_ASSERT(sensor->idac[freq] <= 0x7FU);

            /* Sensor configuration */
            (*pConf) = 0U;
            (*pConf) |= (((uint32_t)scWidget->swClkDiv - 1U) << 20U);
            (*pConf) |= (((uint32_t)scWidget->resolution - 8U) << 16U);
#if (TSI_WIDGET_SC_TOUCHPAD_USED == 1U)
            if(widget->meta->type == TSI_WIDGET_SELF_CAP_TOUCHPAD &&
                    sensor->meta->type == TSI_SENSOR_SELF_CAP_ROW) {
                (*pConf) |= (uint32_t)((TSI_SelfCapTouchpadTypeDef *)scWidget)->idacModRow[freq];
            }
            else
#endif
            {
                (*pConf) |= ((uint32_t)scWidget->idacMod[freq] << 0U);
            }
            if(sensor->idac[freq] != 0U) {
                (*pConf) |= ((uint32_t)sensor->idac[freq] << 8U);
                (*pConf) |= (0x1UL << 15U); /* Enable Compensation IDAC */
            }
            confs[freq].idac1Step[idx] = scWidget->idacStep;
#if (TSI_SC_USE_UNIFIED_IDAC_STEP == 1U)
            confs[freq].idac2Step[idx] = scWidget->idacStep;
#else
            confs[freq].idac2Step[idx] = scWidget->idacCompStep;
#endif
        }
    }
    else if(TSI_WIDGET_IS_MUTUAL_CAP(widget)) {
        /* Mutual-cap widget */
        TSI_MutualCapWidgetTypeDef *mcWidget = (TSI_MutualCapWidgetTypeDef *) widget;
        uint8_t freq;

        /* Assertions */
        TSI_ASSERT(mcWidget->txClkDiv <= 0xFFFU);
        TSI_ASSERT(mcWidget->resolution >= 8U && mcWidget->resolution <= 16U);
        TSI_ASSERT(mcWidget->idacStep <= 6U);

        for(freq = 0U; freq < TSI_TOTAL_SCAN_NUM; freq++) {
            uint32_t *pConf = &(confs[freq].conf[idx]);

            /* Assertions */
            TSI_ASSERT(sensor->idac[freq] <= 0x7FU);

            /* Sensor configuration */
            (*pConf) = 0U;
            (*pConf) |= (((uint32_t)mcWidget->txClkDiv - 1U) << 20U);
            (*pConf) |= (((uint32_t)mcWidget->resolution - 8U) << 16U);
            (*pConf) |= ((uint32_t)sensor->idac[freq] << 0U);
            (*pConf) |= ((uint32_t)sensor->idac[freq] << 8U);
            (*pConf) |= (0x1UL << 15U); /* Dual IDAC mode */
            confs[freq].idac1Step[idx] = mcWidget->idacStep;
            confs[freq].idac2Step[idx] = mcWidget->idacStep;
        }
    }
    else {
        /* Cannot be here */
        return false;
    }

    return true;
}

static bool TSI_IsScanning(TSI_Type *instance)
{
    if(instance->CR & (0x1UL << 0U)) {
        return true;
    }
    else {
        return false;
    }
}

static void TSI_ConfigScanTiming(TSI_DriverTypeDef *drv, TSI_ScanGroupTypeDef *group)
{
    uint64_t pclkFreq = TSI_DEV_BUS_CLOCK_FREQ;
    uint32_t tmpCnt;
    TSI_Type *instance;

    TSI_UNUSED(group)

    TSI_ASSERT(drv->instanceId < TSI_DEV_INSTANCE_NUM);
    instance = INSTANCES[drv->instanceId];

    /*
        SCAN_ZERO: Useless, set to default value(0).
        SCAN_IDLE: Recommended >= 80us. N = (8 * pclkFreq) / 3200000.
        SCAN_INTV: Recommended >= 10us. N = (10 * pclkFreq) / 32000000.
        SMPL_WAIT: Internal comparator needs setup time. Recommended >= 4.
    */
    instance->CCR &= ~(0x7FFFFF0EUL);
    /* SCAN_IDLE --------------------*/
    tmpCnt = (uint32_t)(pclkFreq * 8UL / 3200000UL);
    if(tmpCnt > 0x0UL) { tmpCnt -= 0x1UL; }
    if(tmpCnt >= 0x7FUL) { tmpCnt = 0x7FUL; }
    instance->CCR |= (tmpCnt << 16U);
    /* SCAN_INTV --------------------*/
    tmpCnt = (uint32_t)(pclkFreq * 10UL / 32000000UL);
    if(tmpCnt > 0x0UL) { tmpCnt -= 0x1UL; }
    if(tmpCnt >= 0xFFUL) { tmpCnt = 0xFFUL; }
    instance->CCR |= (tmpCnt << 8U);
    /* SMPL_WAIT --------------------*/
    instance->CCR |= (0x4UL << 1U);
}

static void TSI_DisableAllChannel(TSI_Type *instance)
{
    instance->CHCR0 = 0UL;
    instance->CHCR1 = 0UL;
}

static void TSI_EnableChannel(TSI_Type *instance, uint32_t ch)
{
    if(ch < 32U) {
        instance->CHCR0 |= (0x1UL << ch);
    }
    else {
        instance->CHCR1 |= (0x1UL << (ch - 32U));
    }
}

static void TSI_SetChannelTx(TSI_Type *instance, uint32_t ch)
{
    if(ch < 32U) {
        instance->CHCFGR0 |= (0x1UL << ch);
    }
    else {
        instance->CHCFGR1 |= (0x1UL << (ch - 32U));
    }
}

