GUdaoxi/FH_project/TSI/Library/Devices/fm33ht0xxa_tsi_driver.c
static void TSI_SetChannelRx(TSI_Type *instance, uint32_t ch)
{
    if(ch < 32U) {
        instance->CHCFGR0 &= ~(0x1UL << ch);
    }
    else {
        instance->CHCFGR1 &= ~(0x1UL << (ch - 32U));
    }
}

static void TSI_SetIDAC1Step(TSI_Type *instance, uint8_t step)
{
    instance->ANACR &= ~(0x3UL << 10U);
    switch(step) {
        case TSI_DEV_IDAC_STEP_37P5NA:
            instance->ANACR &= ~(0x1UL << 14U);     /* IDAC1_DOUBLE = 0 */
            instance->ANACR |= (0x0UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_75NA:
            instance->ANACR |= (0x1UL << 14U);      /* IDAC1_DOUBLE = 1 */
            instance->ANACR |= (0x0UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_300NA:
            instance->ANACR &= ~(0x1UL << 14U);     /* IDAC1_DOUBLE = 0 */
            instance->ANACR |= (0x1UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_600NA:
            instance->ANACR |= (0x1UL << 14U);      /* IDAC1_DOUBLE = 1 */
            instance->ANACR |= (0x1UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_1P2UA:
            instance->ANACR &= ~(0x1UL << 14U);     /* IDAC1_DOUBLE = 0 */
            instance->ANACR |= (0x2UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_2P4UA:
            instance->ANACR &= ~(0x1UL << 14U);     /* IDAC1_DOUBLE = 0 */
            instance->ANACR |= (0x3UL << 10U);
            break;

        case TSI_DEV_IDAC_STEP_4P8UA:
            instance->ANACR |= (0x1UL << 14U);      /* IDAC1_DOUBLE = 1 */
            instance->ANACR |= (0x3UL << 10U);
            break;

        default:
            /* Param error */
            TSI_ASSERT(0U);
            break;
    }
}

static void TSI_SetIDAC2Step(TSI_Type *instance, uint8_t step)
{
    instance->ANACR &= ~(0x3UL << 12U);
    switch(step) {
        case TSI_DEV_IDAC_STEP_37P5NA:
            instance->ANACR &= ~(0x1UL << 15U);     /* IDAC2_DOUBLE = 0 */
            instance->ANACR |= (0x0UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_75NA:
            instance->ANACR |= (0x1UL << 15U);      /* IDAC2_DOUBLE = 1 */
            instance->ANACR |= (0x0UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_300NA:
            instance->ANACR &= ~(0x1UL << 15U);     /* IDAC2_DOUBLE = 0 */
            instance->ANACR |= (0x1UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_600NA:
            instance->ANACR |= (0x1UL << 15U);      /* IDAC2_DOUBLE = 1 */
            instance->ANACR |= (0x1UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_1P2UA:
            instance->ANACR &= ~(0x1UL << 15U);     /* IDAC2_DOUBLE = 0 */
            instance->ANACR |= (0x2UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_2P4UA:
            instance->ANACR &= ~(0x1UL << 15U);     /* IDAC2_DOUBLE = 0 */
            instance->ANACR |= (0x3UL << 12U);
            break;

        case TSI_DEV_IDAC_STEP_4P8UA:
            instance->ANACR |= (0x1UL << 15U);      /* IDAC2_DOUBLE = 1 */
            instance->ANACR |= (0x3UL << 12U);
            break;

        default:
            /* Param error */
            TSI_ASSERT(0U);
            break;
    }
}

#ifndef TSI_UNIT_TEST
static void TSI_LoadIDAC1Trim(TSI_Type *instance, uint8_t step, uint8_t dir)
{
    uint16_t *pTrim;

    /* Get trim value */
    switch(step) {
        case TSI_DEV_IDAC_STEP_37P5NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAB0UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFAB8UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_75NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAC0UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFAC8UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_300NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAD0UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFAD8UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_600NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAE8UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFAF8UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_1P2UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB50UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB58UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_2P4UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB70UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB78UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_4P8UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB80UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB88UL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        default:
            /* Cannot be here */
            TSI_ASSERT(0U);
            return;
    }

    /* Check trim value and set to register */
    if(*pTrim != 0xFFFFU) {
        TSI_ASSERT(((*pTrim) ^ (*(pTrim + 2U))) == 0xFFFFU);
        instance->IDACTR = (instance->IDACTR & ~(0x1FUL)) | (uint32_t)(*pTrim);
    }
    else {
        /* Set to default value */
        instance->IDACTR = (instance->IDACTR & ~(0x1FUL)) | (0x10UL);
    }
}

static void TSI_LoadIDAC2Trim(TSI_Type *instance, uint8_t step, uint8_t dir)
{
    uint16_t *pTrim;

    /* Get trim value */
    switch(step) {
        case TSI_DEV_IDAC_STEP_37P5NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAB4UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFABCUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

