GUdaoxi/FH_project/TSI/Library/Devices/fm33ht0xxa_tsi_driver.c
        case TSI_DEV_IDAC_STEP_75NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAC4UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFACCUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_300NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAD4UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFADCUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_600NA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFAECUL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFAFCUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_1P2UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB54UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB5CUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_2P4UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB74UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB7CUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        case TSI_DEV_IDAC_STEP_4P8UA:
            if(dir == TSI_IDAC_DIR_SOURCE) {
                pTrim = (uint16_t *)0x1FFFFB84UL;
            }
            else if(dir == TSI_IDAC_DIR_SINK) {
                pTrim = (uint16_t *)0x1FFFFB8CUL;
            }
            else {
                TSI_ASSERT(0U);
                return;
            }
            break;

        default:
            /* Cannot be here */
            TSI_ASSERT(0U);
            return;
    }

    /* Check trim value and set to register */
    if(*pTrim != 0xFFFFU) {
        TSI_ASSERT(((*pTrim) ^ (*(pTrim + 2U))) == 0xFFFFU);
        instance->IDACTR = (instance->IDACTR & ~(0x1F00UL)) | (uint32_t)((*pTrim) << 8U);
    }
    else {
        /* Set to default value */
        instance->IDACTR = (instance->IDACTR & ~(0x1F00UL)) | (0x10UL << 8U);
    }
}
#endif  /* TSI_UNIT_TEST */

static void TSI_EnableIT(TSI_Type *instance)
{
    /* Enable end of conversion interrupt */
    instance->ISR = (0x1UL << 1U);
    instance->IER |= (0x1UL << 1U);

    /* Enable end of sequence interrupt */
    instance->ISR = (0x1UL << 2U);
    instance->IER |= (0x1UL << 2U);
}

static void TSI_DisableIT(TSI_Type *instance)
{
    /* Disable end of conversion interrupt */
    instance->ISR = (0x1UL << 1U);
    instance->IER &= ~(0x1UL << 1U);

    /* Enable end of sequence interrupt */
    instance->ISR = (0x1UL << 2U);
    instance->IER &= ~(0x1UL << 2U);
}

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))

static void TSI_SetupDMA(TSI_Type *instance)
{
    if(instance == TSI) {
        /* Enable DMA clock */
        CMU->PCLKCR2 |= (1UL << 4U);

        /* Configure DMA write channel (Request #107) */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) &= ~(0xFFFFFFFFUL);
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) |= (TSI_DMA_WR_PRIORITY << 6U);   /* DMA Priority */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) |= (107UL << 8U);                 /* DMA Request */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) |= (0x2UL << 4U);                 /* 32B */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) |= (0x1UL << 0U);                 /* Mem to Periph */
        DMA_REG(PAR, TSI_DMA_WR_CHANNEL) = (uint32_t)&TSI->SPCFGR;

        /* Configure DMA read channel (Request #108) */
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) &= ~(0xFFFFFFFFUL);
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (TSI_DMA_RD_PRIORITY << 6U);   /* DMA Priority */
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (108UL << 8U);                 /* DMA Request */
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (0x2UL << 4U);                 /* 32B */
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (0x0UL << 0U);                 /* Periph to Mem */
        DMA_REG(PAR, TSI_DMA_RD_CHANNEL) = (uint32_t)&TSI->RAWCNTR;

        /* Enable DMA Controller */
        DMA->GCR |= (1UL << 0U);
    }
}

static void TSI_ResetDMA(TSI_Type *instance)
{
    if(instance == TSI) {
        /* Disable and reset channel */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) &= ~(0x1UL << 6U);
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) &= ~(0xFFFFFFFFUL);
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) &= ~(0x1UL << 6U);
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) &= ~(0xFFFFFFFFUL);
    }
}

#endif  /* TSI_USE_DMA && TSI_DEV_SUPPORT_DMA */

static uint32_t TSI_ReadData(TSI_Type *instance)
{
    return ((instance->RAWCNTR) & 0xFFFFU);
}

#ifdef TSI_LIB_USE_ASSERT

static uint32_t TSI_GetTxChannel(uint32_t reg)
{
    return ((reg >> 24U) & 0x3FU);
}

static uint32_t TSI_GetRxChannel(uint32_t reg)
{
    return ((reg >> 16U) & 0x3FU);
}

#endif

#if ((TSI_USE_DMA == 1U) && (TSI_DEV_SUPPORT_DMA == 1U))

static void TSI_StartDMA(TSI_Type *instance, uint32_t *config, uint32_t *data,
                         uint16_t size)
{
    TSI_ASSERT(size > 0U);
    if(instance == TSI) {
        /* Enable DMA write/read request */
        TSI->DMACR |= 0x3U;

        /* Configure address and size, then start the transmission */
        /* DMA write channel */
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) |= (size - 1U) << 16U;
        DMA_REG(MAR0, TSI_DMA_WR_CHANNEL) = (uint32_t) config;
        DMA_REG(CR, TSI_DMA_WR_CHANNEL) |= (0x1UL << 0U);
        /* DMA read channel */
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (size - 1U) << 16U;
        DMA_REG(MAR0, TSI_DMA_RD_CHANNEL) = (uint32_t) data;
        DMA->ISR = (1UL << (8U + TSI_DMA_RD_CHANNEL));
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) |= (0x1UL << 2U);
        DMA_REG(CR, TSI_DMA_RD_CHANNEL) |= (0x1UL << 0U);
    }
}

static void TSI_StopDMA(TSI_Type *instance)
{
    if(instance == TSI) {
        /* Disable DMA interrupt, write/read request and channel */
        TSI->DMACR &= ~(0x3U);
        DMA->ISR = (1UL << (8U + TSI_DMA_RD_CHANNEL));
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) &= ~(0x1UL << 2U);
        DMA_REG(CFGR, TSI_DMA_WR_CHANNEL) &= ~(0x1UL << 6U);
        DMA_REG(CFGR, TSI_DMA_RD_CHANNEL) &= ~(0x1UL << 6U);
    }
}

#endif  /* TSI_USE_DMA && TSI_DEV_SUPPORT_DMA */

void TSI_SetGroundOutput(TSI_DriverTypeDef *driver, TSI_SensorTypeDef *sensor)
{
    GPIO_Type *port;
    uint32_t portId, pin;
    int rxChannel = sensor->meta->rxChannel;
    int txChannel = (sensor->meta->type == TSI_SENSOR_MUTUAL_CAP) ? sensor->meta->txChannel : -1;
    TSI_FOREACH_OBJ(TSI_IOConfTypeDef *, io, driver->ios, driver->ioNum) {
        /* Get GPIO info */
        portId = io->port;
        pin = io->pin;
        TSI_ASSERT(portId < (sizeof(PORTS) / sizeof(GPIO_Type *)));
        port = PORTS[portId];

        if(((txChannel != -1) && (io->channel == txChannel)) ||
                (io->channel == rxChannel)) {
            /* Used. Configure GPIO to analog mode. */
            port->FCR |= (0x3UL << (pin * 2U));     /* Analog mode */
            port->PUDEN &= ~(0x10001UL << pin);     /* Disable pull-up and pull down */
        }
        else {
            /* Unused. Configure GPIO to output mode and set to 0. */
            port->FCR &= ~(0x3UL << (pin * 2U));
            port->FCR |= (0x1UL << (pin * 2U));     /* Output mode */
            port->DRST = (0x1UL << pin);            /* Output 0 */
        }
    }
    TSI_FOREACH_END()
}

void TSI_ResetGroundOutput(TSI_DriverTypeDef *driver)
{
    /* Device IO init */
    TSI_FOREACH(const TSI_IOConfTypeDef * io, driver->ios, driver->ioNum, 0U) {
        TSI_Dev_SetupPort(driver, io);
    }
    TSI_FOREACH_END()
}
